#include <stdio.h>
int main(){
/*int a=5,b=4;
int c=(a+3)+(b+a);
printf("c=%d",c);*/

//如果改写为int c=(b=a+2)-(a=3);这里比较特殊，会产生歧义。原因在于b=a+2和a=3两个子表达式的运算顺序没有定义，而a=3的结果会对前一个式子起影响。对a的修改和读取同时进行。

//如果想修改，可以写成c=(b=a+2,a=2,b-a)由于逗号可以作为序列点，运算顺序被规定为从左向右，
//不会产生既读取又修改的问题。（同时说明-不能作为序列点）上面出错的原因可以认为是c=(f()-g()),两个子表达式没有规定谁先跑，交给编译器自由决定。



//a++和++a都代表给a的值加一，但a++本身的值还是加一前的值，++a的值是加一后的值。同理--a和a--也是。


//关系运算：== != >= <= < >,运算优先级比符号运算低，其中==  !=的优先级要再低，关系运算的值，真为1，伪为0，即printf("5==5")结果为1.
//关系运算的优先级比赋值高。
//辗转相除法：
int a,b,r;
scanf("%d %d",&a,&b);
for(;b!=0;){
r=a%b;
a=b;
b=r;
}
printf("cgd=%d",a);





return 0;
}
/*逻辑运算符：！逻辑非   &&逻辑与   ||逻辑或
！是让真变伪，伪变真. &&要两者皆为真才是真. ||只要一个是真就是真    && ||可能被短路，如if（a==1&&b+=3）若a不等于1，后半句不会判断。
逻辑运算的优先级比关系运算低，但！是单目运算符，因此比关系运算高，如!a<20,是先对a取非再和20比较，要判断a<20,要写成!（a<20)
逻辑运算的结果只有0或1（即伪或真），没有别的结果

三目运算符/条件运算符：a=a>20?a+3:a-1；问号前是判断条件，后面是真的结果，冒号后是伪的结果(注意，由于赋值优先级最低，条件是先判断a<20,再把0或1赋给a，然后计算)
条件运算符可以嵌套，如a>20?(a>50)?a+1:a-1(a<10)?a:1-a;这也说明，条件运算符是右结合的（从右往左算，a?b:c?d:e=a?b:(c?d:e)!=(a?b:c)?d:e)

逗号运算符：将多个表达式隔开，从左到右计算，整体要用括号括起来，最右边的表达式是整体的值 如int a=（1+2，3+4），a的值为7
逗号运算符的优先级比赋值还低,通常在for循环的小括号里使用
*/
