#include <stdio.h>
void max(int x,int y){
    int max;
    if(x<y){
        max=y;
    }else{
        max=x;
    }
printf("max=%d",max);
}

int main(){
    max(4,10);

    return 0;
}
/*int main上面的一个大括号是我们自己定义的函数。包括返回类型，函数名和控制变量。void类型表示函数不返还任何值
如果整个函数放到main函数下面，在调用max函数前需要对max函数进行声明，一般在main函数上面加上函数头和分号：void max(int x,int y)；这样在main函数中调用的时候计算机才能识别。
不能在一个函数体内嵌套一个函数体，但可以在一个函数体内声明一个函数。
如果是int类型的返回，则函数执行完后会返还一个int类型的值，且函数中要有return来表示结束函数执行并返还，如
int max(int x,int y){
    int ret
    if(x<y){
        ret=y;
    }else{
        ret=x;
    }
    return ret;
}
int main(){
    int c=max(3,4);
    return 0;
}
此时在主函数调用max函数时，程序进入max函数，执行完后ret值将作为这个函数的结果赋给c
用大括号括起来的部分被称为块，包括函数大括号，循环大括号，以及直接的大括号，这也是合法的
变量都有作用域和存在期。当变量创建时存在期开始，直到程序执行完他所在的块。作用域也在他所在的块中。
在不同块里可以创建名字相同的变量，如
int main(){
    int a=1; 
    {
        int a=10
    }
    return 0;
}
    此时，里面括号的a值为10，外面括号a为1，并不冲突。而同一个块里不能有名字相同的变量
    调用函数时小括号内的变量叫值，函数体的小括号内变量是参数，调用函数时本身是把值赋给参数，操作时也只是函数内部操作，不会改变main函数里变量的值，即他们变量的作用域不同，程序在一个块里运行时，另一部分根本没有定义
    c语言的函数要格外注意变量类型，无论是返还类型和参数类型，如果调用后的类型与函数不同，会自动将类型转换为和函数定义中的类型。
    定义的函数明确没有控制的变量时，声明建议在小括号内加void。空括号可能会被认为是不明确函数控制的变量，计算机可能会假设这个函数的参数类型是int 若后面的函数体又写参数为double类，就会出错。即
    void fiction();
    int main(){
        viod fiction(double a);
        return 0;
    }
        这种情况会报错
*/