#include <stdio.h>
int main(){
char a=1;
printf("sizeof a=%d\n",sizeof(a++));//sizeof只计算括号内东西占内存字符大小
double b;
scanf("%lf",&b);
printf("b=%.10f\n",b);
long long c=1000;
printf("%lld\n",c);
printf("%c\n",a);
return 0;
}
/*c语言中，变量有不同类型。整形有char short int long   long long 占字符一般为12448。int占字节大小与寄存器有关。一般常量都识别为int。
sizeof()可以计算括号内变量占字节大小
int及更小类型输入输出用%d，long用%ld。 long long用%lld(10进制输入输出，16进制d变x，#x数字前带0x。8进制换o)
printf函数会把小于int的自动转化为int类型，浮点数自动转化为double类型。scanf不会，scanf输入short类型的标准方式是%hd

char也可以当作特殊类型————字符，如char a='1',单引号括起来才是字符，因此，char a=1和char a='1'完全不同，一个是整形的值，一个是字符，字符的值是他的ASCII码值
字符的计算是在计算机内转换为ASCII码值后计算再输出对应的字符的(%c输出的话，%d直接输出ASCII码值），如char c='A';c++;printf("%c"，c)；结果是'B',%d输出的是'B'的ASCII码值
'A'的ASCII码值=65，'a'的ASCII码值=97，小写字母码值=大写字母码值+32，因此假设一个变量char c储存着一个字母字符，想切换大写可以用c+'A'-'a',切小写可以用c+'a'-'A'(其实也可以直接-或+32)
想以字符输入输出要用%c（空格，回车，tab都属于字符）因此整形输入输出时不会读取*整形前面的*空格，回车等键
scanf("%c",&c);假如输入1   printf("%c",c)结果是'1'    printf("%d",c);结果是49，就是计算机内'1'整体的值(注意，scanf函数里不要输入'1'，否则只会读到'，因为%c已经指定了读进来的是字符)
而如果char a=1； printf("%c",c);该结果不可见。因为%c输出的作用是把这个数字当成ASCII编码，交给终端，让终端绘制对应符号其中0~31位和第127位字符不可打印，中间的字符才可打印。
char c；
int i；
scanf("%d %c",i,c);中间有空格，则%d会把输入的两个东西之间的空格全部读完
scanf("%d%c",i,c);中间没空格，那%d把数字读完后，后面第一个跟着的东西就被%c读到

整数类型还有bool，也可以叫逻辑类型，但还是属于整形。使用前要加头文件#include <stdbool.h>,就能用bool true false
但是bool a=6>5,输出a的值还是1，不会是true   bool b=true等价于bool b=1。其他整形也可以使用true和false

计算机内存里的一切都是二进制形式的，计算整数运算时内部只有加法器。计算减法要用到补码。
以一字节的二进制序列演示
0000 0000~0111 1111表示0~127
1111 1111~1000 0000表示-1~-128
因此，第一位可以看成符号位，确定数字正负。
正数的原码反码补码一样，负数的反码是符号位不变，其余数字取反，补码是反码+1.
若在类型前加unsigned，则只有正数，输出时用%u，

浮点类型有float double  long double，占字符一般为4 8 16.都以二进制编码形式存在。输入用%f %lf %Lf 输出用%f %f(%lf) %Lf，想用科学计数法可以把f用e或E替换（输出时是e或E）
float double的有效数位分别是7~8和15~16（自身精度）若不规定输出小数点后几位，一般默认输出小数点后6位。要指定输出小数点后a位，可以在%和f之间加.a  例如输出小数点后十位用%.10lf
若a=1.2345，输出时用%.3lf,结果将是1.235（四舍五入，不是直接截掉后面，和整式除法不同）
float,double都无法表示在0附近很小的一个去心邻域范围内的数。同时，计算机里的浮点数是不精确的，只会取到最近的近似可用的数，而double可用的数更多，因此更精确。同时，浮点数可以表示无穷大（inf）或不存在的数（nan），如0/0就是nan
由于浮点数不精确若判断a=1.234，b=2.345，c=a+b，if（c==3.579）不一定对，可以写成if(fabs(c-3.579)<1e-6)  判断由相等变成在一定误差内，fabs是取绝对值，由于默认6位小数，所以只用前6位对的上就行。
一般浮点数都识别为double类型，想变成foat类型要在数字后加f，long double则加l。

还可以强制转换类型，通常形式为 （类型）值   如（float）1.23 （int）10.2 此时精度可能发生截断 
强制类型转换只是计算了一个新的类型的值，没有改变原来的值。如 int i=32768 ,short s=(short)i;输出i结果不会变。
强制类型转换的运算优先级高于四则运算
如果short i=32768，其二进制为1000 0000 0000 0000，补码计算后输出是-32768。而如果是char i=32768，只有8个比特位，会直接截取最后八个位，即0000 0000，补码输出为0


一般推荐，整式都用int 浮点都用double，除非在进行基层的程序开发。

常量要在类型前加const，一般用大写标注，如const int A，表示常量A，建议常量直接初始化，因为常量值无法改变。

*/